# St7GetNumModesInNFAFile

Returns the number of modes found in a natural frequency result file.

long St7GetNumModesInNFAFile(long uID, char* FileName, long* NumModes)

Input Parameters

uID

Strand7 model file ID.

FileName

Full path and name for the natural frequency result file.

Output Parameters
NumModes

Number of modes in file.